<template>
    <header>
        <!-- 头部开始 -->
        <div class="welcome">
            HI,<br /> I'm
            <span class="gradientText">Yang.JIE</span>
        </div>
        <div class="description">
            😁
            <span class="purpleText"> 业余的</span> 开发者 / 喜欢折腾各种
            <span class="purpleText"> 新鲜事物</span>
        </div>
        <div class="description d-2">
            <p id="typing-text"></p>
        </div>
        <div class="iconContainer">
            <a class="iconItem" data-tip="Github" target="_blank" href="https://github.com/youngdajie">
                <svg t="1704870335945" class="icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="2487" width="22px" height="22px">
                    <path
                        d="M511.6 76.3C264.3 76.2 64 276.4 64 523.5 64 718.9 189.3 885 363.8 946c23.5 5.9 19.9-10.8 19.9-22.2v-77.5c-135.7 15.9-141.2-73.9-150.3-88.9C215 726 171.5 718 184.5 703c30.9-15.9 62.4 4 98.9 57.9 26.4 39.1 77.9 32.5 104 26 5.7-23.5 17.9-44.5 34.7-60.8-140.6-25.2-199.2-111-199.2-213 0-49.5 16.3-95 48.3-131.7-20.4-60.5 1.9-112.3 4.9-120 58.1-5.2 118.5 41.6 123.2 45.3 33-8.9 70.7-13.6 112.9-13.6 42.4 0 80.2 4.9 113.5 13.9 11.3-8.6 67.3-48.8 121.3-43.9 2.9 7.7 24.7 58.3 5.5 118 32.4 36.8 48.9 82.7 48.9 132.3 0 102.2-59 188.1-200 212.9 23.5 23.2 38.1 55.4 38.1 91v112.5c0.8 9 0 17.9 15 17.9 177.1-59.7 304.6-227 304.6-424.1 0-247.2-200.4-447.3-447.5-447.3z"
                        p-id="2488"></path>
                </svg> </a>
            <a class="iconItem" data-tip="Mail" target="_blank" href="mailto:ok@yangjie.site">
                <svg t="1704870588438" class="icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="3174" width="22px" height="22px">
                    <path
                        d="M926.47619 355.644952V780.190476a73.142857 73.142857 0 0 1-73.142857 73.142857H170.666667a73.142857 73.142857 0 0 1-73.142857-73.142857V355.644952l304.103619 257.828572a170.666667 170.666667 0 0 0 220.745142 0L926.47619 355.644952zM853.333333 170.666667a74.044952 74.044952 0 0 1 26.087619 4.778666 72.704 72.704 0 0 1 30.622477 22.186667 73.508571 73.508571 0 0 1 10.678857 17.67619c3.169524 7.509333 5.12 15.652571 5.607619 24.210286L926.47619 243.809524v24.380952L559.469714 581.241905a73.142857 73.142857 0 0 1-91.306666 2.901333l-3.632762-2.925714L97.52381 268.190476v-24.380952a72.899048 72.899048 0 0 1 40.155428-65.292191A72.97219 72.97219 0 0 1 170.666667 170.666667h682.666666z"
                        p-id="3175"></path>
                </svg> </a>
            <a class="iconItem" data-tip="捐赠" onclick="wx('/wxpay.png')" href="javascript:void(0)">
                <svg t="1705247464964" class="icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="4987" width="22px" height="22px">
                    <path
                        d="M995.575172 725.451034c-12.358621-26.835862-38.488276-64.794483-92.689655-94.27862-62.146207-33.721379-136.297931-40.96-208.860689-20.303448l-99.928276 28.424827-279.304828-126.057931H22.775172v489.401379h509.704828l432.375172-195.266207c15.006897-6.708966 26.835862-19.42069 32.662069-34.957241 5.649655-15.36 4.943448-31.955862-1.942069-46.962759z m-482.162758 188.910345H111.051034V601.688276h184.673104l166.664828 75.387586-3.354483 0.882759h-170.372414v88.275862H471.393103l246.819311-70.267586c49.434483-14.124138 101.517241-9.357241 142.653793 12.888275 18.184828 9.886897 30.72 20.833103 39.371034 30.896552l-386.824827 174.609655z"
                        p-id="4988"></path>
                    <path
                        d="M695.437241 163.486897l58.615173-142.30069h-397.24138l66.736552 143.36c-121.82069 53.142069-207.095172 174.433103-207.095172 315.674483 0 28.601379 3.531034 57.202759 10.593103 84.744827l85.627586-21.715862c-5.12-20.48-7.768276-41.666207-7.768275-63.028965 0-141.241379 114.758621-256 256-256s256 114.758621 256 256c0 51.023448-14.830345 100.104828-43.078621 142.300689l73.268965 49.08138c37.958621-56.673103 58.085517-122.88 58.085518-191.382069-0.176552-141.947586-86.686897-264.121379-209.743449-316.733793zM467.508966 91.983448h180.965517l-21.009655 50.846897a348.16 348.16 0 0 0-66.913104-6.708966c-23.834483 0-46.962759 2.471724-69.384827 7.062069l-23.657931-51.2z"
                        p-id="4989"></path>
                    <path
                        d="M683.431724 427.431724v-70.62069h-38.311724l30.190345-30.190344-49.964138-49.964138-62.49931 62.49931h-6.002759L494.344828 276.656552l-49.787587 49.964138 30.013793 30.190344h-38.311724v70.62069h88.275862v35.310345h-88.275862v70.62069h88.275862v52.965517h70.62069v-52.965517h88.275862v-70.62069h-88.275862v-35.310345z"
                        p-id="4990"></path>
                </svg></a>
            <a class="iconItem" data-tip="B站" target="_blank" href="https://space.bilibili.com/646325099">
                <svg t="1704900728948" class="icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="28587" width="22px" height="22px">
                    <path
                        d="M306.005333 117.632L444.330667 256h135.296l138.368-138.325333a42.666667 42.666667 0 0 1 60.373333 60.373333L700.330667 256H789.333333A149.333333 149.333333 0 0 1 938.666667 405.333333v341.333334a149.333333 149.333333 0 0 1-149.333334 149.333333h-554.666666A149.333333 149.333333 0 0 1 85.333333 746.666667v-341.333334A149.333333 149.333333 0 0 1 234.666667 256h88.96L245.632 177.962667a42.666667 42.666667 0 0 1 60.373333-60.373334zM789.333333 341.333333h-554.666666a64 64 0 0 0-63.701334 57.856L170.666667 405.333333v341.333334a64 64 0 0 0 57.856 63.701333L234.666667 810.666667h554.666666a64 64 0 0 0 63.701334-57.856L853.333333 746.666667v-341.333334A64 64 0 0 0 789.333333 341.333333zM341.333333 469.333333a42.666667 42.666667 0 0 1 42.666667 42.666667v85.333333a42.666667 42.666667 0 0 1-85.333333 0v-85.333333a42.666667 42.666667 0 0 1 42.666666-42.666667z m341.333334 0a42.666667 42.666667 0 0 1 42.666666 42.666667v85.333333a42.666667 42.666667 0 0 1-85.333333 0v-85.333333a42.666667 42.666667 0 0 1 42.666667-42.666667z"
                        p-id="28588"></path>
                </svg></a>
            <a class="iconItem" data-tip="昼夜切换">
                <SwitchIcon />
            </a>
            <button @click="showToast"
                style="background: var(--project-item-bg-color);width: 48px;height: 32px;border-radius: 6px;cursor: alias;color: var(--project-item-left-title-color);">通知</button>
        </div>
        <!-- 图标容器结束 -->
    </header>
    <!-- 头部结束 -->

</template>


<script setup>
import { onMounted } from 'vue';
import Typed from 'typed.js';
import { SwitchIcon } from "vue-dark-switch";
onMounted(() => {
    const options = {
        strings: [
            '失去人性，失去很多；失去兽性，失去一切',
            '我爱你，与你有何相干？毁灭你，又与你有何相干？',
            '宇宙就是一座黑暗森林，每个文明都是带枪的猎人，像幽灵般潜行于林间，轻轻拨开挡路的树枝，竭力不让脚步发出一点儿声音，连呼吸都小心翼翼',
            '给岁月以文明，而不是给文明岁月，给时光以生命而不是给生命以时光',
            '弱小和无知不是生存的障碍，傲慢才是',
            '麦克·伊文斯的一句话已成为降临派的座右铭：我们不知道外星文明是什么样子，但知道人类',
            '妈妈，我将变成一只萤火虫',
            '把人类看成虫子的三体人似乎从来没有意识到一个事实：虫子从来没有被战胜过',
            '唯一不可阻挡的是时间，它像一把利刃，无声地切开了坚硬和柔软的一切，恒定地向前推进着，没有任何东西能够使它的行进出现丝毫颠簸，它却改变着一切',
            '消灭人类暴政，世界属于三体',
            '这是人类的落日',
            '没有救世的能力不是你的错，但给世界以希望后又打碎它就是一种不可饶恕的罪恶了',
            '西方人并不比东方人聪明，但是他们却找对了路',
            '邪乎到家必有鬼',
            '我有一个梦，也许有一天，灿烂的阳光能照进黑暗森林',
            '你的无畏来源于你的无知',
            '在中国，任何超脱飞扬的思想都会砰然坠地——现实的引力实在是太沉重了',
            '空不是无，空是一种存在，你得用空这种存在填满自己',
            '孩子问，他们是烈士吗？妈妈说，不是。他们是敌人吗？ 不是。 那他们是什么？ 他们是历史！',
            '前进！前进！！不择手段地前进！！！ ——托马斯·维德',
            '粮食？这不都是粮食吗？每个人看看你们周围，活生生的粮食',
            '不理睬是最大的轻蔑',
            '不要返航，这里不是家！',
            '把海弄干的鱼在海干前上了陆地，从一片黑暗森林奔向另一片黑暗森林',
            '请求一块二向箔，清理用'
        ],
        typeSpeed: 100,
        startDelay: 500,
        showCursor: true,
        loop: true,  // 添加此行以启用循环
        loopDelay: 3000,  // 每次循环之前的延迟时间（毫秒）
        backDelay: 3000  // 退格之前的延迟时间（毫秒）
    };

    new Typed('#typing-text', options);
});

import { useToast } from 'vue-toastification';

// 调用 useToast 函数来获取 toast 实例
const toast = useToast();

// 定义 showToast 方法，用于显示 Toast
const showToast = () => {
    toast('全站有 SW 缓存加速，按 F5 即可全站刷新', {
        position: 'bottom-right',
        timeout: 30000, // 消息显示时长 (毫秒)
    });
    toast('本人工作特殊，联系不上，请见谅！', {
        position: 'bottom-right',
        timeout: 30000, // 消息显示时长 (毫秒)
    });
};

</script>

<style scoped>
/*打字效果*/
.typed-text {
    font-family: monospace;
    white-space: nowrap;
    overflow: hidden;
    border-right: .15em solid orange;
    animation: caret 1s steps(1) infinite;
}

@keyframes caret {
    50% {
        border-color: transparent;
    }
}

#typing-text {
    display: inline;
    margin-right: 10px;
    font-size: 16px;
}

.d-2 {
    height: 64px;
}
</style>